/**
 * Created by xiabingwu on 2016/3/23.
 */
define(function (require, exports, module) {
    var plugin=require('base/component/pluginable');
    var $=plugin.get$();
    var constantVar = {};
    var EMAILMAP={
        'qq.com': 'http://mail.qq.com',
        'sina.com': 'http://mail.sina.com.cn',
        'sina.cn': 'http://mail.sina.com.cn',
        '163.com': 'http://mail.163.com',
        '126.com': 'http://mail.126.com',
        'yeah.net': 'http://www.yeah.net/',
        'sohu.com': 'http://mail.sohu.com/',
        'tom.com': 'http://mail.tom.com/',
        'sogou.com': 'http://mail.sogou.com/',
        '139.com': 'http://mail.10086.cn/',
        'live.com': 'http://login.live.com/',
        'live.cn': 'http://login.live.cn/',
        'live.com.cn': 'http://login.live.com.cn',
        '189.com': 'http://webmail16.189.cn/webmail/',
        'yahoo.com.cn': 'http://mail.cn.yahoo.com/',
        'yahoo.cn': 'http://mail.cn.yahoo.com/',
        'eyou.com': 'http://www.eyou.com/',
        '21cn.com': 'http://mail.21cn.com/',
        '188.com': 'http://www.188.com/',
        'foxmail.com': 'http://mail.qq.com',
        'tencent.com':'http://mail.tencent.com/',
        'vip.qq.com':'http://mail.qq.com',
        'gmail.com':'http://mail.google.com',
        'hotmail.com':'http://hotmail.com',
        'outlook.com':'http://outlook.com',
        'vip.163.com':'http://vip.163.com',
        'vip.126.com':'http://vip.126.com',
        'vip.yeah.net':'http://vip.yeah.net',
        'vip.sina.com':'http://vip.sina.com'
    };
    var ACCOUNTBANKS = [
        {name: '招商银行', id: '001', value: '中国招商银行'},
        {name: '中国银行', id: '002'},
        {name: '中国工商银行', id: '003'},
        {name: '中国农业银行', id: '004'},
        {name: '中国建设银行', id: '005'},
        {name: '兴业银行', id: '006'},
        {name: '中国民生银行', id: '007'},
        {name: '中国邮政储蓄银行', id: '008'},
        {name: '华夏银行', id: '009'},
        {name: '北京银行', id: '010'},
        {name: '上海银行', id: '011'},
        {name: '宁波银行', id: '012'},
        {name: '交通银行', id: '013'},
        {name: '中国光大银行', id: '014'},
        {name: '平安银行', id: '015'},
        {name: '广发银行', id: '016', value: '广发银行股份有限公司'},
        {name: '广州银行', id: '017'},
        {name: '中信银行', id: '018'},
        {name: '上海浦东发展银行', id: '019'}
    ];

    var Errcode = {
        /*企鹅圈（微博）错误码开始*/
        '-59000':'缺少参数',
        '-59002':'没有权限操作',
        '-59003':'无法获取身份，请确保填入的是微博个人主页的链接',
        '-59010':'微博ID已经被其他人申请绑定',
        '-59011':'操作失效（需要绑定管理员qq号）',
        '-59104':'图片上传失败',
        '-59105':'视频错误',

        "-60001": "缺少参数",
        '-61000':'邮箱已注册', //注册邮箱已经被om使用了
        '-61001':'该邮箱已注册企鹅开放平台，请更换其他邮箱', //注册邮箱已经被开放平台使用了
        '-60002': '经过公安系统确认，您的身份信息不存在',
        '-60003': '您的证件已经超过注册媒体的最高限制',
        '-60004': '系统检测您的帐号异常，将封停10分钟，请您喝杯茶歇歇~',
        '-60005': '此号码因多次违规，已被禁用',
        '-60008': '非法微信公众号',
        '-60009': '此微信号已注册过，请使用其他号码！',
        '-60011': '该用户被终身禁用',
        '-60013': '媒体介绍含有敏感词',
        '-60014': '媒体名重复',
        '-60015': '媒体名含有敏感词',
        '-60050': '该QQ号对应的用户不存在',
        '-60051': '该邮箱注册已经完成，请登录',
        '-64000': '系统故障，请稍后重试',
        '-64002': '系统故障，请稍后重试',
        '-64003': '参数值不合法，请检查',
        '-64005': '系统故障，请稍后重试',
        '-64010': '该帐号已经注册，请登录',
        '-64011': '媒体名重复',
        '-64012': '媒体名含有敏感词',
        '-64013': '媒体介绍含有敏感词',
        '-64022': '该帐号已经注册，请登录',
        '-64023': "验证码错误，请重新输入",
        '-64024': '激活邮件发送失败，请稍后重试',
        '-64025': '短信验证码发送失败，请稍后重试',
        '-64026': '该帐号已经注册，请登录',
        '-64027': '此号码因多次违规，已被禁用',
        '-64028': '您的证件已经超过注册媒体的最高限制',
        '-64029': '经过公安系统确认，您的身份信息不存在',
        '-64030': '系统检测您的帐号异常，将封停10分钟，请您喝杯茶歇歇~',
        '-64031': '经过公安系统确认，您的身份信息不存在',
        '-64032': '暂不支持18周岁以下人群注册',
        '-64033': '该帐号尚未注册，请注册',
        '-64034': '密码错误',
        '-64035': '密码格式错误',
        '-64036': '邮箱格式错误',
        '-64037': '手机号码格式错误',
        '-64038': '60s内不允许重复发验证码',
        '-64039':'验证码发送次数过多，请10分钟后再试',
        '-64040': '企鹅号名称长度不符合要求',
        '-64041': '企鹅号简介长度不符合要求',
        '-64042':'暂不支持该类型帐号登录',
        '-64043':'该帐号已经注册，请登录',
        '-64044':'该手机号已被其他账号绑定，请更换手机号',
        '-64045':'该帐号已经注册，请登录',
        '-64046':'该帐号尚未注册，请注册',
        '-64047':'该帐号尚未注册，请注册',
        '-64048':'该帐号尚未注册，请注册',
        '-64050': '非常抱歉，您的修改次数过多，请重新注册',
        '-64051':'激活链接已失效，请重新验证',
        '-64052':'该帐号已经注册，请登录',
        '-64053':'该帐号已经注册，请登录',
        '-64055':'该帐号已经注册，请登录',
        '-64058':'验证码已过期，请重新获取',
        '-64063': '与现名称相同，可直接取消本次修改即可',
        '-64070':'该手机号被限制注册',
        '-64071': '验证码输入错误次数过多，请稍后再试',
        '-64072': '该手机号因多次违规，已被禁用',
        '-64081': '该手机号已超限，1个手机号只能成为2个帐号的联系电话',
        '-64092':'未绑定管理员qq号',
        '-64115': '修改登录手机时，未绑定登录手机号',
        '-64116': '非机构、政府、其他组织类型用户，修改登录手机号无需向旧手机发送验证码',
        '-64117': '修改登陆邮箱时，未绑定登陆邮箱',
        '-64118': '非机构、政府、其他组织类型用户，修改登陆邮箱无需向旧邮箱发送验证码',
        "-64200": "qq登录态校验失败",
        '-64201':'缺少监护人资料',
        '-64300': '验证码校验失败',
        '-70000': '该流量主帐号不存在，请更换帐号重新登录',
        '-70001': '该流量主帐号不存在，请更换帐号重新登录',
        '-70002': '该流量主帐号不存在，请更换帐号重新登录',
        '-70003': '您目前没有开通流量主权限，请满足条件后再次申请',
        '-70004': '您目前没有开通原创补贴权限，请满足条件后再次申请',
        '-70005': '您还没有开通流量主功能，请确认开通',
        '-70006': '您还没有开通原创补贴功能，请确认开通',
        '-70007': '您目前未达到开通原创补贴标准，请满足条件后再次申请',
        '-70008': '流量主信息保存失败，请稍后重试',
        '-70009': '您的原创补贴处于开通状态，无法关闭流量主',
        '-70010': '帐号已存在，无法开通流量主',
        '-70013': '您目前未达到开通流量主标准，请满足条件后再次申请',
        '-70014': '银行户名与主体名称不一致',
        '-71006':'媒体名重复',
        '-71009':'媒体介绍含有敏感词',

        
        '-71010': '主体类型有误',
        '-71011': '没有找到联系人手机号',
        '-71012': '发送超限',
        '-71013': '发送超限',
        '-71014': '验证码失效',
        '-71015': '验证码故障',
        '-71016': '验证码已过期，请重新获取',
        '-71017': '验证码错误，请重新输入',
        '-71018': '源主体类型不符合',
        '-71019': '71019资质问题',
        '-71020': '未完成审核',
        '-71021': '次数已达上限',

        '-75000':'操作失败（-75000）',
        '-75001':'操作失败（-75001）',
        '-75002':'操作失败（-75002）',
        '-75003':'操作失败（-75003）',
        '-75004':'操作失败（-75004）',
        '-75005':'RSS地址为空',
        '-75006':'操作失败（-75006）',
        '-75007':'RSS地址非法',
        '-75008':'操作失败（75008）',
        '-75009':'RSS地址不正确',
        '-75011':'最多添加5条抓取地址',
        '-75012':'抓取地址重复',
        /*mms地址错误码开始*/
        '-81005':'抓取地址链接为空',
        '-81007':'抓取地址链接非法',
        '-81009':'抓取地址链接不正确',
        '-81011':'您输入的域名不在抓取范围，请输入与您资质相符的地址',
        '-20012':'您没有开通版权保护',
        '-20013':'您没有签署授权书',
        '17000':'您的头像不符合平台规定，请重新上传。'
    };


    /**
     *  媒体类型
     */
    var MEDIATYPE = {
        "1":"新闻",
        "2":"娱乐",
        "3":"体育",
        "4":"科技",
        "5":"财经",
        "6":"视觉",
        "7":"思想",
        "8":"视频",
        "9":"时尚",
        "10":"人文",
        "11":"生活",
        "12":"游戏",
        "13":"情感",
        "14":"搞笑",
        "15":"旅游",
        "16":"美食",
        "17":"家居",
        "18":"设计",
        "19":"育儿",
        "20":"汽车",
        "21":"美容",
        "22":"健康",
        "23":"房产",
        "24":"军事",
        "":"历史",
        "26":"教育",
        "27":"宠物",
        "28":"星座",
        "29":"政务",
        "30":"电影",
        "31":"电视剧",
        "47":"影视",
        "32":"音乐",
        "33":"舞蹈",
        "34":"科学",
        "35":"三农",
        "36":"职场",
        "37":"传媒",
        "38":"彩票",
        "39":"国际",
        "40":"数码",
        "41":"摄影",
        "42":"猎奇",
        "43":"心灵",
        "44":"资讯",
        "45":"动漫",
        "46":"文化"
    };

    /**
     *  视频类型
     */
    var VIDEOTYPE = {
        "0":{
            _artClassName:"general",
            _artTypeNmae:""
        },
        "1":{
            _artClassName:"gallery",
            _artTypeNmae:"图集"
        },
        "56":{
            _artClassName:"video",
            _artTypeNmae:"视频"
        },
        "31":{
            _artClassName:"live",
            _artTypeNmae:"直播"
        },
        "74":{
            _artClassName:"live",
            _artTypeNmae:"视频直播发布"
        },
        "82":{
            _artClassName:"third-party-live",
            _artTypeNmae:"第三方视频直播发布"
        }
    };

    var layerHeight = 659;
    
    constantVar.getLayerHeight = function () {
        return layerHeight;
    };       

    var rootUrl=location.href.replace(/com.*$/,'com/');//获取根地址 主要给qq登录用 qq登录需要绝对地址回跳
    //获取银行名称和id
    constantVar.getAccountBanks=function(){
        return $.extend(true, [], ACCOUNTBANKS);//深拷贝
    };
    constantVar.getArea=function(){
        return $.extend(true, {}, window.SIMPLEAREA);//深拷贝
    };
    constantVar.getRootUrl=function(){
        return rootUrl;
    };
    constantVar.islteIE7=function(){
        return !!window.ltIE7;
    };
    constantVar.getEmailMap=function(){
        return $.extend(true,{},EMAILMAP);
    };
    constantVar.getErrCode = function(){
        return $.extend(true, {}, Errcode);//深拷贝
    }
    constantVar.getErrInfo = function(errCode){
        return Errcode[errCode] || false;
    }

    constantVar.getMediaType = function(){
        return $.extend(true,{},MEDIATYPE);
    };


    constantVar.getVideoType = function(){
        return $.extend(true,{},VIDEOTYPE);
    };

    return constantVar;
});
